data/azure/aks/cpu/256/node-265/raw/sysbench-fileio-run-file-test-modeseqwr
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     41264.20
    fsyncs/s:                     52820.17

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               644.75

General statistics:
    total time:                          10.0005s
    total number of events:              940848

Latency (ms):
         min:                                    0.00
         avg:                                    0.01
         max:                                   18.03
         95th percentile:                        0.02
         sum:                                 9884.50

Threads fairness:
    events (avg/stddev):           940848.0000/0.00
    execution time (avg/stddev):   9.8845/0.00